mi_proyecto/app/Models/EventModel.php

SELECT *
FROM `event`
WHERE `user_id` = 41
---
    public function getEvents(int $userId)
    {
        return $this->where('user_id', $userId)->findAll();