mi_proyecto/app/Models/UserModel.php

    public function findByMail(string $email): array|null
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'alejandro@gmail.com'
 LIMIT 1