mi_proyecto/app/Controllers/FeedbackController.php

    public function index()
    {
        $session = session();

        if (!$session->has('user_id')) {
            return redirect()->to('/login')->with('error', 'Debes iniciar sesión primero.');
        }

        $userModel = new UserModel();
        $user = $userModel->find($session->get('user_id'));

        if (!$user) {
            return redirect()->to('/login')->with('error', 'Usuario no encontrado.');
        }

        $data = [
            'user_avatar' => 'assets/media/avatars/default.jpg',
            'user_name' => $user['name'] ?? 'Usuario',
            'user_email' => $user['email'] ?? 'correo@example.com',
            'user_phone' => $user['number_phone'] ?? '',
            'users' => $userModel->findAll()
---
SELECT *
FROM `users`
WHERE `users`.`id` = '37'
SELECT *
FROM `users`

       $query = $query->orderBy($sort, $order);

        // Obtener feedbacks paginados
        $data["feedbacks"] = $query->paginate($perPage);
---
SELECT *
FROM `feedback`
ORDER BY `id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `feedback`

    public function delete($id)
    {
        if ($this->session->get('id_rol') != 1) {
            return redirect()->to('/feedback')->with('error', 'No tienes permisos para realizar esta acción.');
        }

        $feedback = $this->feedbackModel->find($id);

        if ($feedback) {
            $this->feedbackModel->delete($id);
---
SELECT *
FROM `feedback`
WHERE `feedback`.`id` = '33'
DELETE FROM `feedback`
WHERE `id` IN ('33')