mi_proyecto/app/Controllers/GrafiController.php

SELECT `product_name`, `amount`
FROM `products`
---
    public function getChartData()
    {
        $model = new ProductsModel();
        $data = $model->select('product_name, amount')->findAll();