mi_proyecto/app/Controllers/ProductController.php

    public function index()
    {
        $session = session();

        if (!$session->has('user_id')) {
            return redirect()->to('/login')->with('error', 'Debes iniciar sesión primero.');
        }

        $userModel = new UserModel();
        $user = $userModel->find($session->get('user_id'));

        if (!$user) {
            return redirect()->to('/login')->with('error', 'Usuario no encontrado.');
        }

        $data = [
            'user_avatar' => 'assets/media/avatars/default.jpg',
            'user_name' => $user['name'] ?? 'Usuario',
            'user_email' => $user['email'] ?? 'correo@example.com',
            'user_phone' => $user['number_phone'] ?? '',
            'users' => $userModel->findAll()
---
SELECT *
FROM `users`
WHERE `users`.`id` = '36'
SELECT *
FROM `users`

       $query = $query->orderBy($sort, $order);

        // Obtener productos paginados
        $data["products"] = $query->paginate($perPage);
---
SELECT *
FROM `products`
ORDER BY `id` ASC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `products`