mi_proyecto/app/Controllers/UserController.php

    public function index()
    {
        $userModel = new UserModel();
        $session = session();

        if (!$session->has('user_id')) {
            return redirect()->to('/login')->with('error', 'You must log in first.');
        }

        $user = $userModel->find($session->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '36'

        $query = $query->orderBy($sort, $order);

        // Obtener usuarios paginados
        $data["users"] = $query->paginate($perPage, 'default', $page);
---
SELECT *
FROM `users`
ORDER BY `id` ASC
 LIMIT 9, 3
SELECT COUNT(*) AS `numrows`
FROM `users`