mi_proyecto/app/Views/graficos.php

													<!--begin::Mixed Widget 7-->
													<?php
														$userModel = new \App\Models\UserModel();
														$totalUsers = $userModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`

													<!--begin::Mixed Widget 10-->
													<?php
														$productModel = new \App\Models\ProductsModel();
														$totalProducts = $productModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `products`